-- 任务配置表

local data={}

-- 剧情信息
data.plot={
	[1]={
		[1]={
			{type=1,otype=2,camp=1,text="最近发生了多起大额诈骗事件，幕后黑手一定要接受制裁！！"},
			{type=3,camp=1,text="金彪，你的一举一动都被我掌控，悔过自新吧，还来得及。"},
			{type=12,camp=2,npcid=4,text="小样，想制裁我？"},
			{type=12,camp=2,npcid=4,text="先问我的小弟们答应不答应，弟兄们给我上！！"},
		},
	},
	[5]={
		[1]={
			{type=1,otype=2,camp=1,text="终于摸到你的藏身之所，束手就擒吧！"},
			{type=3,camp=1,text="不知悔改的社会渣滓，无路可逃了吧。"},
			{type=12,camp=2,npcid=4,text="你来制裁我啊，哥不是吹，你们这样的来一打哥都分分钟搞定。"},
			{type=12,camp=2,npcid=4,text="哇哈哈~"},
			{type=1,otype=2,camp=1,text="看谁笑到最后吧。"},
			{type=3,camp=1,text="呵呵。"},
		},
		[2]={
			{type=1,otype=2,camp=1,text="呼，金彪得到了应有的惩罚。任何人都不能藐视法律！"},
			{type=3,camp=1,text="这只是正义制裁的开始。"},
			{type=3,camp=1,text="颤栗吧犯罪分子，死亡通知单的下一个就是你！"},
		},
	},
	[6]={
		[1]={
			{type=1,otype=2,camp=1,text="从女生坠楼案里竟然牵扯出这种肮脏的罪行，贾校长你最好老实交待。"},
			{type=3,camp=1,text="不可饶恕，又一个社会的败类。。。"},
			{type=12,camp=2,npcid=10,text="造谣，污蔑懂吗，我可是懂法的。恕不奉陪了。"},
			{type=12,camp=2,npcid=4,text="哇哈哈~"},
			{type=1,otype=2,camp=1,text="狐狸尾巴早露出来了，收集他的罪证！"},
		},
	},
	[10]={
		[1]={ --第二大关 第五小关开头
			{type=1,otype=2,camp=1,text="贾雄起把你的脏手从妹子身上拿开！你被捕了！！"},
			{type=3,camp=1,text="故伎重演，你也就到这里了。"},
			{type=12,camp=2,npcid=10,text="啊。。。休想搞掉我，老子也不是吃素的！！来啊~"},
		},
		[2]={ --第二大关 第五小关干掉校长
			{type=1,otype=2,camp=1,text="好险，来晚一步这禽兽就得手了，以后的任务还很艰巨啊。"},
			{type=3,camp=1,text="死亡通知单从不失手。这次也不例外。"},
		},
	},
	[11]={ --第三大关 第一小关 11
		[1]={ --第二大关 第五小关开头
			{type=1,otype=2,camp=1,text="无数失踪的孩子，钱浩博你具有重大嫌疑！"},
			{type=3,camp=1,text="死亡通知单也不能表达我的愤怒。"},
			{type=12,camp=2,npcid=9,text="科学，这是研究，你们无法理解，幸好有人来支援我了，哈哈。给我杀！！"},
		},
	},
	[15]={ --第三大关 第五小关 15
		[1]={ --开头
			{type=1,otype=2,camp=1,text="及时停手吧，你已经造成了这么多无辜的伤亡！"},
			{type=3,camp=1,text="你的犯罪生涯即将结束！"},
			{type=12,camp=2,npcid=9,text="你们这些低等人，等我的技术开花结果就是你们的末日！！"},
			{type=3,camp=1,text="你等不到那天了。"},
		},
		[2]={ --干掉医生
			{type=1,otype=2,camp=1,text="虽然他的罪恶停止了，但是他造成了多少无辜家庭的悲剧，"},
			{type=1,otype=2,camp=1,text="为了制止这种悲剧重演我们要继续努力！"},
			{type=1,otype=2,camp=1,text="还有那个Darker，一定要抓住他，不能让这种法外之徒逍遥！"},
			{type=3,camp=1,text="。。。该下一张通知单了。"},
		},
	},
	[16]={ --第四大关 第一小关 16
		[1]={ --开头
			{type=1,otype=2,camp=1,text="这次的作案手法很是奇怪？是Darker还是另有其人？"},
			{type=3,camp=1,text="有人冒充我作案？。。。"},
		},
	},
	[20]={ --第四大关 第五小关 20
		[1]={ --开头
			{type=1,otype=2,camp=1,text="不要再越陷越深了，相信法律会还你公道的。"},
			{type=3,camp=1,text="停手吧，你不能越陷越深了。"},
			{type=12,camp=2,npcid=15,text="停手？根本停不下来，我不会相信所谓的法律和正义，我要自己做裁决者！！"},
			{type=3,camp=1,text="。。。。。"},
		},
		[2]={ --干掉假Darker
			{type=1,otype=2,camp=1,text="我们始终相信法律会站在我们这边的。"},
			{type=1,otype=2,camp=1,text="还有，Darker不久也会接受法律的制裁。"},
			{type=3,camp=1,text="。。。。人间还有多少这种悲剧在上演。。。。"},
		},
	},
	[21]={ --第五大关 第一小关 21
		[1]={ --开头
			{type=1,otype=2,camp=1,all=true,text="我们已经收集了足够的线索，Darker，你已经跑不掉了。"},
			{type=3,camp=2,all=true,text="。。。枉费心机。。。"},
			{type=1,otype=2,camp=1,all=true,text="你要做的是迷途知返，马上认罪伏法。"},
			{type=3,camp=2,all=true,text="伏法，你们相信所谓的法律吗？多说无益，尽管来吧。"},
		},
	},
	[25]={ --第五大关 第五小关 25
		[1]={ --开头
			{type=1,otype=2,camp=1,all=true,text="Darker你已无路可走了。"},
			{type=3,camp=2,all=true,text="我等待这一天也很久了。"},
		},
		[2]={ --罗飞 剑云
			{type=1,otype=2,all=true,camp=1,text="一切都结束了。"},
			{type=3,camp=2,all=true,text="你以为真的一切都结束了吗。"},
			{type=1,otype=2,all=true,camp=1,text="。。。。。。"},
		},
	},
	[26]={ --第六大关 第一小关 26
		[1]={ --开头
			{type=1,otype=2,camp=1,text="追踪线索反而中了对手的圈套。这里是？。。"},
			{type=3,camp=1,text="有意思，想不到还有这种小把戏。"},
			{type=1,otype=2,camp=1,text="看来正处在幻术制造的世界中。不管怎么样，一定要突破这个迷局！"},
			{type=3,camp=1,text="我陪你们玩玩。"},
			{type=12,camp=2,npcid=27,text="心里测试启动，继续观察目标。"},
		},
	},
	[30]={ --第六大关 第五小关 30
		[1]={ --开头
			{type=1,otype=2,camp=1,text="想不到是你，梦瑶？！"},
			{type=3,camp=1,text="是你？怎么，要我加入你们的组织？"},
			{type=1,otype=2,camp=1,text="这么天真浪漫的女孩怎么会制造这些惨案！"},
			{type=3,camp=1,text="呵呵，实力这东西可是说说就行了。我得亲自试一试。"},
			{type=12,camp=2,npcid=27,text="这才是正义的梦想，你们这些蝼蚁必须彻底接受治疗！！",text3="怕是你要后悔的，没人能打破我的梦境。"},
		},
		[2]={ --干掉boss 罗飞 剑云
			{type=1,otype=2,camp=1,text="她的想法初衷是好的，可惜在实践中逐渐迷失了自我。。。"},
			{type=3,camp=1,text="自大的家伙，你已经坠入冥府魔道的循环之中。收下这张通知单吧。"},
		},
	},
}


data.guide = {
	[1] = {
		"技能已经开启了，这些个技能可不是我吹，对你帮助很大的哦。长按后拖拽到下方的技能槽中，来，试一下。",
	},
	[3] = {
		"大家好，我是精英队队长。现在我来指引你进入暗黑者的世界~",
		"首先请选择你的阵营-法律or正义。您在游戏中取得的成就会影响阵营的数值变化。",
		"好了，下面请选择你的阵营。",
	},
	[4] = {
		"恭喜您获得初次登录奖励，请点击右上方奖励选项获取！",
	},
	[7] = {
		"点击界面上的剧情选项可以进入故事模式，挑战模式会在你完成第一大关卡后自动开启。",
	},
	[10] = {
		"小小热身一下相信难不倒你啦~你现在2级了，可以装备新的技能了。",
		"赶紧点击左下方角色按钮去装备技能吧！",
	},
	[14] = {
		"重头戏来了，我们精英队也得靠好装备不是？",
		"现在来跟我获取神装！",
	},
	[15] = {
		"点击确定获取装备，游戏中所有怪都有几率掉落超级装备，祝你早日一身神装~",
	},
	[16] = {
		"每当你升级时会获得2点属性点，现在可以使用喽~",
	},
	[17] = {
		"我来跟你说说属性点的作用。",
		"生命，攻击，精神，顾名思义，每点属性点都会直接增加角色的这三个属性。",
		"幸运属性则会体现在角色的暴击几率上，幸运越高越容易触发暴击。",
		"属性点在10级之前是可以随意洗点的，先加一点攻击试试吧！",
	},
	[19] = {
		"你有新的装备，快跟我来看看。",
	},
	[20] = {
		"点击装备，在弹出界面中会显示该装备的详细信息。",
		"界面左下角会显示穿上该装备后角色的属性变化。",
		"试试穿上这件装备吧！",
	},
	[22] = {
		"ok，不亏是我这个精英队长看好的人，现在你可以继续挑战罪恶了，let's go！！！",
	},
	[23] = {
		"很好，案件第一号你已经成功完成！",
		"现在，你可以去挑战模式一展身手了。不过，你得先起个响亮的名字才能和其他玩家一较高下。",
	},
	[24] = {
		"现在起一个高端大气上档次的名字吧！",
	},
	[25] = {
		"一切就绪，让我们去扫荡恶势力！",
	},
	[27] = {
		"尽可能的坚持更多的波数，获取成吨的奖励！加油，开始吧！",
	},
}

data.help = {
	normal = {
		title="扫荡黑帮",
		content={
			{info="只有通关案件才会开启对应的黑帮扫荡任务。",color=display.COLOR_BLACK},
			{info="获得的奖励与各势力黑帮和战斗波数有关。波数越高获得的相关奖励越多。",color=display.COLOR_BLACK},
			{info="扫荡过程中死亡或者主动放弃即代表挑战结束，进入结算。",color=display.COLOR_BLACK},
			{info="每日可进行10次扫荡。",color=display.COLOR_BLACK},
			{info="扫荡排行榜按最高波数和最少时间进行排名。",color=display.COLOR_BLACK},
		}
	},
	eh = {
		title="强化须知",
		content={
			{info="强化可以提升装备的主属性值",color=display.COLOR_BLACK},
			{info="强化需要消耗相同部件的装备换取经验，同时也需要相应的金币。",color=display.COLOR_BLACK},
			{info="精英强化无需消耗装备，一次精英强化可使装备直接进阶，同时需要花费一点点钻石。",color=display.COLOR_BLACK},
			{info="不同品阶的装备可强化的等阶也不一样。",color=display.COLOR_BLACK},
			{info="已经强化过的装备也可作为材料，其经验也会有相应的转化。",color=display.COLOR_BLACK},
			{info="注意别吞噬了重要的装备。",color=display.COLOR_RED},
		}
	},
	longyu = {
		title="无尽龙宇",
		content={
			{info="无尽龙宇目前开放35层，周一开放1-5层，周二开放6-10层，以此类推。",color=display.COLOR_BLACK},
			{info="每天都有5次免费挑战无尽龙宇的机会。",color=display.COLOR_BLACK},
			{info="当天次数用尽时，可消耗钻石购买挑战次数。",color=display.COLOR_BLACK},
			{info="使用金币刷新Buff效果，有概率获得大量的属性加成。",color=display.COLOR_BLACK},
			{info="使用钻石刷新守关Boss，可帮助你轻松通过关卡。",color=display.COLOR_BLACK},
			{info="注：无尽龙宇每通关5层都可领取超值奖励。",color=display.COLOR_RED},
			{info="注：无尽龙宇每周日晚12点重置层数，请合理安排时间。",color=display.COLOR_RED},
		}
	},
}

return data